# file open

In [40]:
file = open('hey.txt', 'r')

In [41]:
file.readline()

'Hey ! you just opened the file hey.txt\n'

In [42]:
file.readline()

'second line\n'

In [43]:
file.readline()

'third line'

In [28]:
file.close()

In [29]:
with open('hey.txt', 'r') as file1:
    print(file1.read())
#closed implicitly

Hey ! you just opened the file hey.txt

In [63]:
file2 = open('new.txt', 'w')

In [64]:
file2.write('successfully written to new.txt')

31

In [66]:
file2.write('\noverwritten')

12

In [67]:
file2.close()

# pandas

In [71]:
import pandas as pd

In [72]:
path = 'sales.csv'

In [74]:
df = pd.read_csv(path)

In [75]:
df.head()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Australia and Oceania,Tuvalu,Baby Food,Offline,H,5/28/2010,669165933,6/27/2010,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Central America and the Caribbean,Grenada,Cereal,Online,C,8/22/2012,963881480,9/15/2012,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Europe,Russia,Office Supplies,Offline,L,5/2/2014,341417157,5/8/2014,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sub-Saharan Africa,Sao Tome and Principe,Fruits,Online,C,6/20/2014,514321792,7/5/2014,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Sub-Saharan Africa,Rwanda,Office Supplies,Offline,L,2/1/2013,115456712,2/6/2013,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [106]:
city_cases = {'city':['indore','bhopal','gwalior'], 'cases':[830, 234, 45]}

In [107]:
df = pd.DataFrame(city_cases)

In [108]:
df.head()

      city  cases
0   indore    830
1   bhopal    234
2  gwalior     45

In [109]:
df.loc[0:1, 'city']

0    indore
1    bhopal
Name: city, dtype: object

In [110]:
df.iloc[0:2,0:2]

     city  cases
0  indore    830
1  bhopal    234

In [111]:
df['city'].unique()

array(['indore', 'bhopal', 'gwalior'], dtype=object)

In [112]:
df['cases'] > 200

0     True
1     True
2    False
Name: cases, dtype: bool

In [115]:
df1 = df[df['cases'] > 200]

In [117]:
df1.to_csv('edited.csv')

# numpy

In [118]:
#ND arrays are fixed in size and have same kinds of elemenets

In [120]:
import numpy as np